Repository: dotnet/sourcelink
Catalog: src/Common/GitProvider/xlf/CommonResources.*.xlf
Languages: cs, es, fr, it, ko, pt_br, zh_hant

# AtLeastOneRepositoryHostIsRequired
source: {0} item group is empty. At least one {1} repository host is required in order to generate SourceLink.
cs: Skupina položek {0} je prázdná. Kvůli generování zdrojového odkazu se vyžaduje alespoň jeden hostitel úložiště {1}.
es: El grupo de elementos {0} está vacío. Se requiere al menos un repositorio {1} a fin de generar SourceLink.
fr: Le groupe d'éléments {0} est vide. Au moins un hôte de dépôt {1} est nécessaire pour générer SourceLink.
it: Il gruppo di elementi {0} è vuoto. Per generare SourceLink, è necessario almeno un host di repository di {1}.
ko: {0} 항목 그룹이 비어 있습니다. SourceLink를 생성하려면 {1} 리포지토리 호스트가 하나 이상 필요합니다.
pt_br: O grupo de itens {0} está vazio. Pelo menos um host de repositório {1} é necessário para gerar o SourceLink.
zh_hant: {0} 項目群組是空的。至少需要一個 {1} 存放庫主機，才可產生 SourceLink。

# IgnoringInvalidHostName
source: Ignoring invalid host name: '{0}' -- expected 'domain[:port]'.
cs: Ignoruje se neplatný název hostitele: {0} – očekávalo se domain[:port].
es: Ignorando el nombre de host no válido: "{0}" -- esperado "dominio[:puerto]".
fr: Nom d’hôte non valide ignoré : '{0}' -- 'domain[:p ort]' attendu.
it: Il nome host '{0}' non valido verrà ignorato. È previsto 'domain[:port]'.
ko: 잘못된 호스트 이름 무시: '{0}' -- 'domain[:port]'이 필요합니다.
pt_br: Ignorando nome do host inválido: '{0}' -- esperado 'domain[:p ort]'.
zh_hant: 忽略無效的主機名稱: '{0}' -- 預期為 'domain[:port]'。

# ItemOfItemGroupMustSpecifyMetadata
source: Item '{0}' of item group '{1}' must specify metadata '{2}'
cs: Položka {0} ve skupině položek {1} musí uvádět metadata {2}.
es: El elemento "{0}" del grupo de elementos "{1}" debe especificar los metadatos "{2}"
fr: L'élément '{0}' du groupe d'éléments '{1}' doit spécifier les métadonnées '{2}'
it: L'elemento '{0}' del gruppo di elementi '{1}' deve specificare i metadati '{2}'
ko: 항목 그룹 '{1}'의 '{0}' 항목은 '{2}' 메타데이터를 지정해야 합니다.
pt_br: Item '{0}' do grupo de item '{1}' deve especificar metadados '{2}'
zh_hant: 項目群組 '{1}' 的項目 '{0}' 必須指定中繼資料 '{2}'

# NoWellFormedHostUrisSpecified
source: No well-formed host URIs specified: {0}.
cs: Nebyly zadány žádné identifikátory URI hostitele ve správném formátu: {0}.
es: No se especificó ningún URI de host con formato correcto: {0}.
fr: Aucun URI d’hôte bien formé spécifié : {0}.
it: Nessun URI host ben formato specificato: {0}.
ko: 올바른 형식의 호스트 URI가 지정되지 않았습니다({0}).
pt_br: Nenhum URIs de host bem formado especificado: {0}.
zh_hant: 未指定格式良好的主機 URI: {0}。

# UnableToDetermineRepositoryUrl
source: Unable to determine repository url, the source code won't be available via source link.
cs: Nejde určit adresu URL úložiště. Zdrojový kód nebude k dispozici přes odkaz na zdroj.
es: No se puede determinar la URL del repositorio, el código fuente no estará disponible a través del vínculo de origen.
fr: Impossible de déterminer l'URL du dépôt, le code source n'est pas disponible via Source Link.
it: Non è possibile determinare l'URL del repository. Il codice sorgente non sarà disponibile tramite il collegamento all'origine.
ko: 리포지토리 URL을 확인할 수 없으며, 소스 링크를 통해 소스 코드를 사용할 수 없습니다.
pt_br: Não é possível determinar a URL do repositório, o código-fonte não estará disponível através do source link.
zh_hant: 無法判斷存放庫 URL，無法透過來源連結取得原始程式碼。

# ValueOfWithIdentityIsInvalid
source: The value of {0} with identity '{1}' is invalid: '{2}'
cs: Hodnota {0} s identitou {1} je neplatná: {2}
es: El valor de {0} con la identidad "{1}" no es válido: "{2}"
fr: La valeur de {0} avec l'identité '{1}' n’est pas valide : '{2}'
it: Il valore di {0} con identità '{1}' non è valido: '{2}'
ko: ID가 '{1}'인 {0}의 값은 잘못되었습니다. '{2}'
pt_br: O valor de {0} com identidade '{1}' é inválido: '{2}'
zh_hant: 識別碼為 '{1}' 的 {0} 值無效: '{2}'

# ValueOfWithIdentityIsNotValidCommitHash
source: The value of {0} with identity '{1}' is not a valid commit hash: '{2}'
cs: Hodnota {0} s identitou {1} nepředstavuje platnou potvrzovací hodnotu hash: {2}
es: El valor de {0} con la identidad "{1}" no es un hash de confirmación válido: "{2}"
fr: La valeur de {0} avec l'identité '{1}' n'est pas un hachage de validation valide : '{2}'
it: Il valore di {0} con identità '{1}' non è un hash di commit valido: '{2}'
ko: ID가 '{1}'인 {0}의 값은 유효한 커밋 해시가 아닙니다. '{2}'
pt_br: O valor de {0} com identidade '{1}' não é um hash de confirmação válido: '{2}'
zh_hant: 識別碼為 '{1}' 的 {0} 值不是有效的認可雜湊: '{2}'

# ValuePassedToTaskParameterNotValidDomainName
source: The value passed to task parameter {0} is not a valid domain name: '{1}'
cs: Hodnota předaná parametru úlohy {0} není platný název domény: {1}
es: El valor pasado al parámetro de tarea {0} no es un nombre de dominio válido: "{1}"
fr: La valeur passée au paramètre de tâche {0} n'est pas un nom de domaine valide : '{1}'
it: Il valore passato al parametro {0} dell'attività non è un nome di dominio valido: '{1}'
ko: 작업 매개 변수 {0}에 전달되는 값이 유효한 도메인 이름이 아닙니다. '{1}'
pt_br: O valor passado para o parâmetro de tarefa {0} não é um nome de domínio válido: '{1}'
zh_hant: 傳遞給工作參數 {0} 的值不是有效的網域名稱: '{1}'

# ValuePassedToTaskParameterNotValidHostUri
source: The value passed to task parameter {0} is not a valid host URI: '{1}'
cs: Hodnota předaná parametru úlohy {0} není platný identifikátor URI hostitele: {1}
es: El valor pasado al parámetro de tarea {0} no es un URI de host válido: "{1}"
fr: La valeur passée au paramètre de tâche {0} n'est pas un URI d'hôte valide : '{1}'
it: Il valore passato al parametro {0} dell'attività non è un URI host valido: '{1}'
ko: 작업 매개 변수 {0}에 전달되는 값이 유효한 호스트 URI가 아닙니다. '{1}'
pt_br: O valor passado para o parâmetro de tarefa {0} não é um URI de host válido: '{1}'
zh_hant: 傳遞給工作參數 {0} 的值不是有效的主機 URI: '{1}'

# ValuePassedToTaskParameterNotValidUri
source: The value passed to task parameter {0} is not a valid URI: '{1}'
cs: Hodnota předaná do parametru úlohy {0} nepředstavuje platný identifikátor URI: {1}
es: El valor pasado al parámetro de tarea {0} no es un URI válido: "{1}"
fr: La valeur passée au paramètre de tâche {0} n'est pas un URI valide : '{1}'
it: Il valore passato al parametro {0} dell'attività non è un URI valido: '{1}'
ko: 작업 매개 변수 {0}에 전달된 값은 유효한 URI가 아닙니다. '{1}'
pt_br: O valor passado para o parâmetro de tarefa {0} não é um URI válido: '{1}'
zh_hant: 傳遞給工作參數 {0} 的值不是有效的 URI: '{1}'
