Repository: dotnet/sourcelink
Catalog: src/Shared/xlf/CommonResources.*.xlf
Languages: ru, tr, zh_hans

# AtLeastOneRepositoryHostIsRequired
source: {0} item group is empty. At least one {1} repository host is required in order to generate SourceLink.
ru: Группа элементов {0} пуста. Для создания SourceLink нужно указать хотя бы один хост репозитория {1}.
tr: {0} öğe grubu boş. SourceLink oluşturmak için en az bir {1} depo konağı gereklidir.
zh_hans: {0} 项目组为空。至少需要一个 {1} 存储库主机才能生成 SourceLink。

# IgnoringInvalidHostName
source: Ignoring invalid host name: '{0}' -- expected 'domain[:port]'.
ru: Пропускается недопустимое имя узла: "{0}" — ожидается "domain[:port]".
tr: Geçersiz ana bilgisayar adı yoksayılıyor: '{0}' -- expected 'domain[:port]'.
zh_hans: 忽略无效的主机名: "{0}"-- 应为 "domain[:port]"。

# ItemOfItemGroupMustSpecifyMetadata
source: Item '{0}' of item group '{1}' must specify metadata '{2}'
ru: Необходимо указать метаданные '{2}' для элемента '{0}' в группе элементов '{1}'
tr: '{1}' öğe grubunun '{0}' öğesi, '{2}' meta verilerini belirtmelidir
zh_hans: 项组 "{1}" 的项 "{0}" 必须指定元数据 "{2}"

# NoWellFormedHostUrisSpecified
source: No well-formed host URIs specified: {0}.
ru: Не указаны URI узлов с правильным форматом: {0}.
tr: İyi biçimlendirilmiş ana bilgisayar URI'leri belirtilmedi: {0}.
zh_hans: 未指定格式正确的主机 URI: {0}。

# UnableToDetermineRepositoryUrl
source: Unable to determine repository url, the source code won't be available via source link.
ru: Не удается определить URL-адрес репозитория, исходный код не будет доступен по исходной ссылке.
tr: Depo URL'si belirlenemiyor. Kaynak kod, kaynak bağlantısı aracılığıyla kullanılamayacak.
zh_hans: 无法确定仓库 URL，源代码将无法通过源链接获得。

# ValueOfWithIdentityIsInvalid
source: The value of {0} with identity '{1}' is invalid: '{2}'
ru: Значение {0} с идентификатором '{1}' является недопустимым: '{2}'
tr: {1} kimliğine sahip {0} değeri geçerli değil: '{2}'
zh_hans: 具有标识 "{1}" 的 {0} 的值无效: "{2}"

# ValueOfWithIdentityIsNotValidCommitHash
source: The value of {0} with identity '{1}' is not a valid commit hash: '{2}'
ru: Значение {0} с идентификатором '{1}' не является допустимым хэшем фиксации: '{2}'
tr: '{1}' kimliğine sahip olan {0} değeri, geçerli bir işleme karması değil: '{2}'
zh_hans: 具有标识 "{1}" 的 {0} 的值不是有效的提交哈希: "{2}"

# ValuePassedToTaskParameterNotValidDomainName
source: The value passed to task parameter {0} is not a valid domain name: '{1}'
ru: Значение, передаваемое параметру задачи {0}, не является допустимым доменным именем: "{1}"
tr: {0} görev parametresine geçirilen değer geçerli bir etki alanı adı değil: '{1}'
zh_hans: 传递给任务参数 {0} 的值不是有效的域名: '{1}'

# ValuePassedToTaskParameterNotValidHostUri
source: The value passed to task parameter {0} is not a valid host URI: '{1}'
ru: Значение, передаваемое параметру задачи {0}, не является допустимым URI узла: "{1}"
tr: {0} görev parametresine geçirilen değer geçerli bir konak URI’si değil: '{1}'
zh_hans: 传递给任务参数 {0} 的值不是有效的主机 URI: '{1}'

# ValuePassedToTaskParameterNotValidUri
source: The value passed to task parameter {0} is not a valid URI: '{1}'
ru: Значение, переданное в качестве параметра задачи {0}, не является допустимым URI: '{1}'
tr: {0} görev parametresine geçirilen değer, geçerli bir URI değil: '{1}'
zh_hans: 传递给任务参数 {0} 的值不是有效的 URI: "{1}"
