Repository: dotnet/sourcelink
Catalog: src/SourceLink.Common/xlf/Resources.*.xlf
Languages: cs, es, fr, ja, pl, pt_br, ru, tr

# MustEndWithDirectorySeparator
source: {0} must end with a directory separator: '{1}'
cs: {0} musí končit oddělovačem adresářů: {1}
es: {0} debe terminar con un separador de directorios: "{1}"
fr: {0} doit se terminer par un séparateur de répertoire : '{1}'
ja: {0} の終わりは、ディレクトリの区切り記号にする必要があります: '{1}'
pl: Element {0} musi kończyć się separatorem katalogów: „{1}”
pt_br: {0} precisa terminar com um separador de diretório: '{1}'
ru: В конце {0} должен быть разделитель каталогов: "{1}"
tr: {0} bir dizin ayırıcısı ile sonlanmalıdır: '{1}'

# MustNotContainWildcard
source: {0} must not contain wildcard '*': '{1}'
cs: {0} nesmí obsahovat zástupný znak *: {1}
es: {0} no debe contener ningún comodín "*": "{1}"
fr: {0} ne doit pas contenir le caractère générique '*' : '{1}'
ja: {0} にワイルドカード '*' を含めることはできません: '{1}'
pl: Element {0} nie może zawierać symbolu wieloznacznego „*”: „{1}”
pt_br: {0} não pode conter um curinga '*': '{1}'
ru: В {0} не должно быть подстановочного знака "*": "{1}"
tr: {0}, '*' joker karakterini içeremez: '{1}'

# MustContainSingleWildcard
source: {0} must contain a single wildcard '*': '{1}'"
cs: {0} musí obsahovat jeden zástupný znak *: {1}"
es: {0} debe contener un solo comodín '*': '{1}'"
fr: {0} doit contenir un seul caractère générique '*' : '{1}'"
ja: {0} には 1 つのワイルドカード '*' を含める必要があります: '{1}'
pl: Element {0} musi zawierać jeden symbol wieloznaczny „*”: „{1}”"
pt_br: {0} precisa conter um único curinga '*': '{1}'
ru: В {0} должен быть один подстановочный знак "*": "{1}"
tr: {0} tek bir '*' joker karakterini içermelidir: '{1}'

# IsEmpty
source: {0} is empty: '{1}'
cs: {0} je prázdný: {1}
es: {0} está vacío: "{1}"
fr: {0} est vide : '{1}'
ja: {0} が空です: '{1}'
pl: Element {0} jest pusty: „{1}”
pt_br: {0} está vazio: '{1}'
ru: В {0} пусто: "{1}"
tr: {0} boş: '{1}'

# ErrorWritingToSourceLinkFile
source: Error writing to source link file '{0}': {1}
cs: Chyba při zápisu do zdrojového souboru propojení {0}: {1}
es: Error al escribir en el archivo de vínculo de origen "{0}": {1}
fr: Erreur d'écriture dans le fichier Source Link '{0}' : {1}
ja: ソース リンク ファイル '{0}' への書き込みエラー: {1}
pl: Błąd podczas zapisywania do pliku linku do źródła „{0}”: {1}
pt_br: Erro ao gravar para o arquivo do source link '{0}': {1}
ru: Ошибка при записи в файл исходных ссылок '{0}': {1}
tr: '{0}' kaynak bağlantısı dosyasına yazılırken bir hata oluştu: {1}

# SourceControlInformationIsNotAvailableGeneratedSourceLinkEmpty
source: Source control information is not available - the generated source link is empty.
cs: Informace o řízení zdrojů nejsou k dispozici - vygenerovaný odkaz na zdroj je prázdný.
es: La información de control del código fuente no está disponible: el vínculo de origen generado está vacío.
fr: Les informations de contrôle de code source ne sont pas disponibles - le lien source généré est vide.
ja: ソース コントロール情報は利用できません。 生成されたソース リンクが空です。
pl: Informacje o kontroli źródła są niedostępne — wygenerowany link do źródła jest pusty.
pt_br: As informações de controle de origem não estão disponíveis – o source link origem gerado está vazio.
ru: Информация о системе управления версиями недоступна — созданная исходная ссылка является пустой.
tr: Kaynak denetimi bilgileri kullanılamıyor. Oluşturulan kaynak bağlantısı boş.

# SourceLinkEmptyDeletingExistingFile
source: Source Link is empty, deleting existing file: '{0}'.
cs: Source Link je prázdný, odstraňuje se existující soubor: „{0}“.
es: El vínculo de origen está vacío, eliminando el archivo existente: '{0}'.
fr: Source Link est vide, suppression du fichier existant : '{0}'.
ja: Source Link が空で、既存のファイルを削除しています: '{0}'。
pl: Source Link jest pusty. Usuwanie istniejącego pliku: „{0}”.
pt_br: O Link de Origem está vazio, excluindo o arquivo existente: '{0}'.
ru: Source Link пуст, выполняется удаление существующего файла: "{0}".
tr: Source Link boş, mevcut dosya siliniyor: '{0}'.

# SourceLinkEmptyNoExistingFile
source: Source Link is empty, file '{0}' does not exist.
cs: Source Link je prázdný, soubor „{0}“ neexistuje.
es: El vínculo de origen está vacío, el archivo '{0}' no existe.
fr: Source Link est vide, le fichier '{0}' n’existe pas.
ja: Source Link が空で、ファイル '{0}' は存在しません。
pl: Source Link jest pusty, plik „{0}” nie istnieje.
pt_br: O Link de Origem está vazio, o arquivo '{0}' não existe.
ru: Source Link пуст, файл "{0}" не существует.
tr: Source Link boş, '{0}' dosyası yok.

# SourceLinkFileUpToDate
source: Source Link file '{0}' is up-to-date.
cs: Soubor Source Link „{0}“ je aktuální.
es: El archivo de Source Link '{0}' está actualizado.
fr: Le fichier '{0}' de Source Link est à jour.
ja: Source Link ファイル '{0}' は最新です。
pl: Plik Source Link „{0}” jest aktualny.
pt_br: O arquivo de link de origem '{0}' está atualizado.
ru: Файл Source Link "{0}" обновлен.
tr: '{0}' Source Link dosyası güncel.

# SourceLinkFileUpdated
source: Updating Source Link file '{0}'.
cs: Aktualizuje se soubor Source Link „{0}“.
es: Actualizando archivo de Source Link '{0}'.
fr: Mise à jour du fichier '{0}' de Source Link.
ja: Source Link ファイル '{0}' を更新しています。
pl: Aktualizowanie pliku Source Link „{0}”.
pt_br: Atualizando o arquivo de link de origem '{0}'.
ru: Обновление файла Source Link "{0}".
tr: '{0}' Source Link dosyası güncelleştiriliyor.
