Repository: dotnet/sourcelink
Catalog: src/Common/xlf/CommonResources.*.xlf
Languages: de, ja, pl

# AtLeastOneRepositoryHostIsRequired
source: {0} item group is empty. At least one {1} repository host is required in order to generate SourceLink.
de: Die Elementgruppe "{0}" ist leer. Mindestens ein {1}-Repositoryhost wird benötigt, um SourceLink zu generieren.
ja: {0} 項目グループが空です。SourceLink を生成するには、少なくとも 1 つの {1} リポジトリ ホストが必要です。
pl: Grupa elementów {0} jest pusta. Wymagany jest co najmniej jeden host repozytorium {1} w celu wygenerowania elementu SourceLink.

# IgnoringInvalidHostName
source: Ignoring invalid host name: '{0}' -- expected 'domain[:port]'.
de: Ungültiger Hostname wird ignoriert: "{0}" -- erwartet wurde "domain[:p ort]".
ja: 無効なホスト名を無視しています: '{0}' -- 'domain[:p ort]' が必要です。
pl: Ignorowanie nieprawidłowej nazwy hosta: '{0}' -- oczekiwano 'domain[:port]'.

# ItemOfItemGroupMustSpecifyMetadata
source: Item '{0}' of item group '{1}' must specify metadata '{2}'
de: Das Element "{0}" der Elementgruppe "{1}" muss die Metadaten "{2}" angeben.
ja: 項目グループ '{1}' の項目 '{0}' には、メタデータ '{2}' を指定する必要があります
pl: Element „{0}” grupy elementów „{1}” musi określać metadane „{2}”.

# NoWellFormedHostUrisSpecified
source: No well-formed host URIs specified: {0}.
de: Es wurden keine wohlgeformten Host-URIs angegeben: {0}.
ja: 整形式のホスト URI が指定されていません: {0}。
pl: Nie określono poprawnie sformułowanych identyfikatorów URI hosta: {0}.

# UnableToDetermineRepositoryUrl
source: Unable to determine repository url, the source code won't be available via source link.
de: Die URL für das Repository konnte nicht ermittelt werden. Daher ist der Quellcode nicht über die Quellverknüpfung verfügbar.
ja: リポジトリのURLを特定できません。ソース リンクを使用してソース コードを利用できません。
pl: Nie można określić adresu URL repozytorium, kod źródłowy nie będzie dostępny za pośrednictwem linku do źródła.

# ValueOfWithIdentityIsInvalid
source: The value of {0} with identity '{1}' is invalid: '{2}'
de: Der Wert von "{0}" mit der Identität "{1}" ist ungültig: "{2}"
ja: ID '{1}' の {0} の値が無効です: '{2}'
pl: Wartość {0} z tożsamością „{1}” jest nieprawidłowa: „{2}”

# ValueOfWithIdentityIsNotValidCommitHash
source: The value of {0} with identity '{1}' is not a valid commit hash: '{2}'
de: Der Wert von "{0}" mit der Identität "{1}" ist kein gültiger Commithash: "{2}"
ja: ID '{1}' の {0} の値が有効なコミット ハッシュではありません: '{2}'
pl: Wartość {0} z tożsamością „{1}” nie jest prawidłowym skrótem zatwierdzenia: „{2}”.

# ValuePassedToTaskParameterNotValidDomainName
source: The value passed to task parameter {0} is not a valid domain name: '{1}'
de: Der an den Taskparameter "{0}" übergebene Wert ist kein gültiger Domänenname: "{1}"
ja: タスク パラメーター {0} に渡された値は有効なドメイン名ではありません: '{1}'
pl: Wartość przekazana do parametru zadania {0} nie jest prawidłową nazwą domeny: „{1}”

# ValuePassedToTaskParameterNotValidHostUri
source: The value passed to task parameter {0} is not a valid host URI: '{1}'
de: Der an den Taskparameter "{0}" übergebene Wert ist kein gültiger Host-URI: "{1}"
ja: タスク パラメーター {0} に渡された値は有効なホスト URI ではありません: '{1}'
pl: Wartość przekazana do parametru zadania {0} nie jest prawidłowym identyfikatorem URI hosta: „{1}”

# ValuePassedToTaskParameterNotValidUri
source: The value passed to task parameter {0} is not a valid URI: '{1}'
de: Der an den Taskparameter "{0}" übergebene Wert ist kein gültiger URI: "{1}"
ja: タスクのパラメーター {0} に渡された値は、有効な URI ではありません: '{1}'
pl: Wartość przekazana do parametru zadania {0} nie jest prawidłowym identyfikatorem URI: „{1}”
