Repository: dotnet/sourcelink
Catalog: src/Microsoft.Build.Tasks.Git/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ConfigurationFileRecursionExceededMaximumAllowedDepth
source: Configuration file recursion exceeded maximum allowed depth of {0}.
cs: Rekurze konfiguračního souboru překročila maximální povolenou hloubku {0}.
de: Die Rekursion der Konfigurationsdatei hat die maximal zulässige Tiefe von {0} überschritten.
es: La recursividad del archivo de configuración superó la profundidad máxima permitida de {0}.
fr: La récursivité du fichier de configuration a dépassé la profondeur maximale autorisée de {0}.
it: La ricorsione del file di configurazione ha superato la profondità massima consentita di {0}.
ja: 構成ファイルの再帰が、許容されている深さの上限 {0} を超えました。
ko: 구성 파일 재귀가 허용되는 최대 깊이 {0}을(를) 초과했습니다.
pl: Rekursja pliku konfiguracji przekroczyła maksymalną dozwoloną głębokość równą {0}.
pt_br: A recursão do arquivo de configuração excedeu a profundidade máxima permitida de {0}.
ru: Для рекурсии файла конфигурации превышена максимально допустимая глубина {0}.
tr: Yapılandırma dosyası özyinelemesi izin verilen maksimum {0} derinliğini aştı.
zh_hans: 配置文件递归超过了允许的最大深度 {0}。
zh_hant: 組態檔遞迴已超過最大允許深度 {0}。

# ErrorParsingConfigLineInFile
source: Error parsing config line {0} in file '{1}': {2}
cs: Při analýze konfiguračního řádku {0} v souboru {1} došlo k chybě: {2}
es: Error al analizar la línea {0} de configuración en el archivo '{1}': {2}
fr: Erreur lors de l’analyse du {0} de ligne de configuration dans le fichier « {1} » : {2}
it: Errore durante l'analisi della riga di configurazione {0} nel file '{1}': {2}
ja: 構成行 {0} (ファイル '{1}' 内) の解析中にエラーが発生しました: {2}
pl: Błąd podczas analizowania wiersza konfiguracji {0} w pliku „{1}”: {2}
pt_br: Erro ao analisar a linha de configuração {0} no arquivo “{1}”: {2}
ru: Ошибка при анализе строки конфигурации {0} в файле "{1}": {2}
tr: '{1}' dosyasındaki {0} yapılandırma satırı ayrıştırılırken hata oluştu: {2}
zh_hant: 剖析檔案 '{1}' 中的設定行 {0} 時發生錯誤: {2}

# ErrorReadingGitRepositoryInformation
source: Error reading git repository information: {0}
cs: Chyba při čtení informací o úložišti Git: {0}
de: Fehler beim Lesen der Git-Repositoryinformationen: {0}
es: Error al leer la información del repositorio de Git: {0}
fr: Erreur lors de la lecture des informations du dépôt git : {0}
it: Si è verificato un errore durante la lettura delle informazioni sul repository GIT: {0}
ja: Git リポジトリ情報の読み取りでエラーが発生しました: {0}
ko: Git 리포지토리 정보를 읽는 동안 오류가 발생했습니다. {0}
pl: Błąd podczas odczytywania informacji o repozytorium git: {0}
pt_br: Erro ao ler informações do repositório git: {0}
ru: Ошибка при чтении сведений о репозитории Git: {0}
tr: Git deposu bilgileri okunurken hata: {0}
zh_hans: 读取 GIT 存储库信息时出错: {0}
zh_hant: 讀取 git 存放庫資訊時發生錯誤: {0}

# FormatOfFileIsInvalid
source: The format of the file '{0}' is invalid.
cs: Formát souboru {0} není platný.
de: Das Format der Datei "{0}" ist ungültig.
es: El formato del archivo "{0}" no es válido.
fr: Le format de fichier '{0}' n'est pas valide.
it: Il formato del file '{0}' non è valido.
ja: ファイル '{0}' の形式は無効です。
ko: '{0}' 파일의 형식이 잘못되었습니다.
pl: Format pliku „{0}” jest nieprawidłowy.
pt_br: O formato do arquivo '{0}' é inválido.
ru: Формат файла "{0}" является недопустимым.
tr: '{0}' adlı dosyanın biçimi geçersiz.
zh_hans: 文件“{0}”的格式无效。
zh_hant: 檔案 '{0}' 的格式無效。

# HomeRelativePathsAreNotAllowed
source: Home relative paths are not allowed when {0} is '{1}': '{2}'.
cs: Když je {0} nastavené na {1}, cesty relativní vzhledem k domovské složce se nepovolují: {2}
de: Relative Startpfade sind nicht zulässig, wenn {0} den Wert "{1}" aufweist: "{2}".
es: No se permiten rutas de acceso relativas principales cuando {0} es "{1}": "{2}".
fr: Les chemins relatifs du répertoire de base ne sont pas autorisés quand {0} est '{1}' : '{2}'.
it: Non sono consentiti percorsi relativi per la home directory quando {0} è '{1}': '{2}'.
ja: {0} が '{1}' の場合、ホームの相対パスは許可されません: '{2}'。
ko: {0}이(가) '{1}': '{2}'인 경우에는 홈 상대 경로를 사용할 수 없습니다.
pl: Ścieżki względne określone względem katalogu głównego nie są dozwolone, gdy element {0} ma wartość „{1}”: „{2}”.
pt_br: Caminhos relativos à página inicial não são permitidos quando {0} é '{1}': '{2}'.
ru: Относительные пути к домашнему каталогу не допускаются, если {0} имеет значение "{1}": "{2}".
tr: {0} '{1}' olduğunda giriş göreli yollarına izin verilmez: '{2}'
zh_hans: 当 {0} 为“{1}”时，不允许主相对路径:“{2}”。
zh_hant: 當 {0} 為 '{1}' 時，不允許主目錄相對路徑: '{2}'。

# InvalidFormatOfFileAtPath
source: Repository does not have a working directory.
cs: Úložiště nemá pracovní adresář.
de: Das Repository verfügt über kein Arbeitsverzeichnis.
es: El repositorio no tiene un directorio de trabajo.
fr: Le dépôt ne dispose pas d'un répertoire de travail.
it: Per il repository non esiste alcuna directory di lavoro.
ja: リポジトリに作業ディレクトリがありません。
ko: 리포지토리에 작업 디렉터리가 없습니다.
pl: Repozytorium nie ma katalogu roboczego.
pt_br: O repositório não tem um diretório de trabalho.
ru: Репозиторий не содержит рабочего каталога.
tr: Depoda çalışma dizini yok.
zh_hans: 存储库不具有工作目录。
zh_hant: 存放庫沒有工作目錄。

# InvalidModulePath
source: Invalid module path: '{0}'.
cs: Neplatná cesta k modulu: {0}
de: Ungültiger Modulpfad: {0}.
es: Ruta de acceso al módulo no válida: "{0}".
fr: Chemin de module non valide : '{0}'.
it: Percorso del modulo non valido: '{0}'.
ja: 無効なモジュール パス: '{0}'。
ko: 모듈 경로 '{0}'이(가) 잘못되었습니다.
pl: Nieprawidłowa ścieżka modułu: „{0}”.
pt_br: Caminho de módulo inválido: '{0}'.
ru: Недопустимый путь к модулю: "{0}".
tr: Modül yolu geçersiz: '{0}'.
zh_hans: 模块路径无效:“{0}”。
zh_hant: 模組路徑無效: '{0}'。

# InvalidReference
source: Invalid reference: '{0}'.
cs: Neplatný odkaz: {0}
de: Ungültiger Verweis: {0}.
es: Referencia no válida: "{0}".
fr: Référence non valide : '{0}'.
it: Riferimento non valido: '{0}'.
ja: 無効な参照: '{0}'。
ko: '{0}' 참조가 잘못되었습니다.
pl: Nieprawidłowe odwołanie: „{0}”.
pt_br: Referência inválida: '{0}'.
ru: Недопустимая ссылка: "{0}".
tr: Tablo başvurusu geçersiz: '{0}'.
zh_hans: 引用无效:“{0}”。
zh_hant: 參考無效: '{0}'。

# InvalidRepositoryRemoteUrl
source: The URL of repository remote '{0}' is invalid: '{1}'.
cs: Adresa URL vzdáleného úložiště {0} je neplatná: {1}.
de: Die URL des Remote-Objekts "{0}" des Repositorys ist ungültig: "{1}".
es: La URL del "{0}" remoto del repositorio no es válida: "{1}".
fr: L'URL du dépôt distant « {0} » n'est pas valide : « {1} ».
it: L'URL del repository remoto '{0}' non è valido: '{1}'.
ja: リモート リポジトリ '{0}' の URL が有効ではありません: '{1}'。
ko: 리포지토리 원격 '{0}'의 URL이 잘못되었습니다. '{1}'.
pl: Adres URL lokalizacji zdalnej „{0}” repozytorium jest nieprawidłowy: „{1}”.
pt_br: A URL do repositório remoto '{0}' não é válida: '{1}'.
ru: URL-адрес удаленного репозитория "{0}" является недопустимым: "{1}".
tr: '{0}' uzak deposunun URL'si geçersiz: '{1}'.
zh_hans: 远程存储库“{0}”的 URL 无效:“{1}”。
zh_hant: 存放庫遠端 ‘{0}’ 的 URL 無效: ‘{1}’。

# InvalidSubmodulePath
source: The path of submodule '{0}' is missing or invalid: '{1}'.
cs: Cesta k dílčímu modulu {0} chybí nebo není platná: {1}
de: Der Pfad des Submoduls "{0}" fehlt oder ist ungültig: "{1}".
es: Falta la ruta de acceso del submódulo "{0}" o no es válida: "{1}".
fr: Le chemin du sous-module '{0}' est manquant ou non valide : '{1}'.
it: Il percorso del modulo secondario '{0}' manca oppure non è valido: '{1}'.
ja: サブモジュール '{0}' のパスが見つからないか無効です: '{1}'。
ko: '{0}' 하위 모듈의 경로가 없거나 잘못되었습니다. '{1}'
pl: Brak ścieżki modułu podrzędnego „{0}” lub jest ona nieprawidłowa: „{1}”.
pt_br: O caminho do submódulo '{0}' está ausente ou é inválido: '{1}'.
ru: Путь к подмодулю "{0}" отсутствует или является недопустимым: "{1}".
tr: '{0}' alt modülünün yolu eksik veya geçersiz: '{1}'
zh_hans: 缺少子模块“{0}”的路径或该路径无效:“{1}”。
zh_hant: 缺少子模組 '{0}' 的路徑或其無效: '{1}'。

# InvalidSubmoduleUrl
source: The URL of submodule '{0}' is missing or invalid: '{1}'.
cs: Adresa URL dílčího modulu {0} chybí nebo není platná: {1}
de: Die URL des Submoduls "{0}" fehlt oder ist ungültig: "{1}".
es: Falta la dirección URL del submódulo "{0}" o no es válida: "{1}".
fr: L'URL du sous-module '{0}' est manquante ou non valide : '{1}'.
it: L'URL del modulo secondario '{0}' manca oppure non è valido: '{1}'.
ja: サブモジュール '{0}' の URL が見つからないか無効です: '{1}'。
ko: '{0}' 하위 모듈의 URL이 없거나 잘못되었습니다. '{1}'
pl: Brak adresu URL modułu podrzędnego „{0}” lub jest on nieprawidłowy: „{1}”.
pt_br: A URL do submódulo '{0}' está ausente ou é inválida: '{1}'.
ru: URL-адрес подмодуля "{0}" отсутствует или является недопустимым: "{1}".
tr: '{0}' alt modülünün URL'si eksik veya geçersiz: '{1}'
zh_hans: 缺少子模块“{0}”的 URL 或其无效:“{1}”。
zh_hant: 缺少子模組 '{0}' 的 URL 或其無效: '{1}'。

source: Path must be absolute.
cs: Cesta musí být absolutní.
de: Der Pfad muss absolut sein.
es: La ruta de acceso debe ser absoluta.
fr: Le chemin doit être absolu.
it: Il percorso deve essere assoluto.
ja: パスは絶対パスでなければなりません。
ko: 경로는 절대 경로여야 합니다.
pl: Ścieżka musi być bezwzględna.
pt_br: O caminho precisa ser absoluto.
ru: Путь должен быть абсолютным.
tr: Yol mutlak olmalıdır.
zh_hans: 路径必须是绝对路径。
zh_hant: 路徑必須是絕對路徑。

# PathMustBeFilePath
source: Path must be a file path.
cs: Cesta musí představovat cestu k souboru.
de: Der Pfad muss ein Dateipfad sein.
es: La ruta de acceso debe ser una ruta de archivo.
fr: Le chemin doit être un chemin de fichier.
it: Il percorso deve essere un percorso file.
ja: パスはファイル パスでなければなりません。
ko: 경로는 파일 경로여야 합니다.
pl: Ścieżka musi być ścieżką do pliku.
pt_br: O caminho precisa ser um caminho de arquivo.
ru: Необходимо указать путь к файлу.
tr: Yol, bir dosya yolu olmalıdır.
zh_hans: 路径必须是文件路径。
zh_hant: 路徑必須是檔案路徑。

# PathSpecifiedInFileIsInvalid
source: Path specified in file '{0}' is invalid: '{1}'.
cs: Cesta zadaná v souboru {0} není platná: {1}
de: Der in der Datei "{0}" angegebene Pfad ist ungültig: "{1}".
es: La ruta de acceso especificada en el archivo "{0}" no es válida: "{1}".
fr: Le chemin spécifié dans le fichier '{0}' est non valide : '{1}'.
it: Il percorso specificato nel file '{0}' non è valido: '{1}'.
ja: ファイル '{0}' で指定されたパスが無効です: '{1}'。
ko: '{0}' 파일에 지정된 경로가 잘못되었습니다. '{1}'
pl: Ścieżka określona w pliku „{0}” jest nieprawidłowa: „{1}”.
pt_br: O caminho especificado no arquivo '{0}' é inválido: '{1}'.
ru: В файле "{0}" указан недопустимый путь: "{1}".
tr: '{0}' dosyasında belirtilen yol geçersiz: '{1}'.
zh_hans: 在文件“{0}”中指定的路径无效:“{1}”。
zh_hant: 在檔案 '{0}' 中指定的路徑無效: '{1}'。

# PathSpecifiedInFileIsNotAbsolute
source: Path specified in file '{0}' is not absolute: '{1}'.
cs: Cesta zadaná v souboru {0} není absolutní: {1}
de: Der in der Datei "{0}" angegebene Pfad ist nicht absolut: "{1}".
es: La ruta de acceso especificada en el archivo "{0}" no es absoluta: "{1}".
fr: Le chemin spécifié dans le fichier '{0}' n'est pas absolu : '{1}'.
it: Il percorso specificato nel file '{0}' non è assoluto: '{1}'.
ja: ファイル '{0}' で指定されたパスは絶対パスではありません: '{1}'。
ko: '{0}' 파일에 지정된 경로는 절대 경로가 아닙니다. '{1}'
pl: Ścieżka określona w pliku „{0}” nie jest bezwzględna: „{1}”.
pt_br: O caminho especificado no arquivo '{0}' não é absoluto: '{1}'.
ru: Путь, указанный в файле "{0}", не является абсолютным: "{1}".
tr: '{0}' dosyasında belirtilen yol mutlak değil: '{1}'.
zh_hans: 在文件“{0}”指定的路径不是绝对路径:“{1}”。
zh_hant: 在檔案 '{0}' 中指定的路徑不是絕對路徑: '{1}'。

# RecursionDetectedWhileResolvingReference
source: Recursion detected while resolving reference: '{0}'.
cs: Při překladu odkazu se zjistila rekurze: {0}.
de: Beim Auflösen des folgenden Verweises wurde eine Rekursion erkannt: {0}.
es: Recursividad detectada al resolver la referencia: "{0}".
fr: Récursivité détectée lors de la résolution de la référence : '{0}'.
it: È stata rilevata una ricorsione durante la risoluzione del riferimento: '{0}'.
ja: 参照の解決中に再帰が検出されました: '{0}'。
ko: '{0}' 참조를 확인하는 동안 재귀가 검색되었습니다.
pl: Wykryto rekursję podczas rozpoznawania odwołania: „{0}”.
pt_br: Recursão detectada ao resolver referência: '{0}'.
ru: Обнаружена рекурсия при разрешении ссылки: "{0}".
tr: Başvuru çözümlenirken özyineleme saptandı: '{0}'.
zh_hans: 解析引用时检测到递归:“{0}”。
zh_hant: 解析參考時偵測到遞迴: '{0}'。

# RepositoryDoesNotHaveSpecifiedRemote
source: Repository '{0}' does not have the specified remote '{1}'; using '{2}' instead.
cs: Úložiště {0} nemá zadané vzdálené úložiště {1}. Místo toho se použije {2}.
de: Das Repository "{0}" verfügt nicht über das angegebene Remoterepository "{1}". Stattdessen wird "{2}" verwendet.
es: El repositorio "{0}" no tiene el repositorio remoto "{1}" especificado; se usará "{2}" en su lugar.
fr: Le dépôt '{0}' n'a pas le dépôt distant '{1}' spécifié. Utilisation de '{2}' à la place.
it: Il repository remoto '{1}' specificato non è presente nel repository '{0}'. Verrà usato '{2}'.
ja: リポジトリ '{0}' には、指定されたリモート '{1}' がありません。代わりに '{2}' が使用されています。
ko: 리포지토리 '{0}'에 지정한 원격 리포지토리 '{1}'이(가) 없습니다. 대신 '{2}'을(를) 사용합니다.
pl: Repozytorium „{0}” nie ma określonego repozytorium zdalnego „{1}”. W zastępstwie używane jest repozytorium „{2}”.
pt_br: O repositório '{0}' não tem o repositório remoto '{1}' especificado. Em vez dele, ele está usando '{2}'.
ru: Репозиторий "{0}" не содержит указанный удаленный репозиторий "{1}"; вместо него будет использован репозиторий "{2}".
tr: '{0}' deposu, belirtilen '{1}' uzak deposuna sahip değil. Bunun yerine '{2}' kullanılıyor.
zh_hans: 存储库“{0}”不具有指定的远程“{1}”；请改用“{2}”。
zh_hant: 存放庫 '{0}' 沒有指定的遠端 '{1}'; 請改用 '{2}'。

# RepositoryDoesNotHaveWorkingDirectory
source: Repository does not have a working directory.
cs: Úložiště nemá pracovní adresář.
de: Das Repository verfügt über kein Arbeitsverzeichnis.
es: El repositorio no tiene un directorio de trabajo.
fr: Le dépôt ne dispose pas d'un répertoire de travail.
it: Per il repository non esiste alcuna directory di lavoro.
ja: リポジトリに作業ディレクトリがありません。
ko: 리포지토리에 작업 디렉터리가 없습니다.
pl: Repozytorium nie ma katalogu roboczego.
pt_br: O repositório não tem um diretório de trabalho.
ru: Репозиторий не содержит рабочего каталога.
tr: Depoda çalışma dizini yok.
zh_hans: 存储库不具有工作目录。
zh_hant: 存放庫沒有工作目錄。

# RepositoryHasNoRemote
source: Repository '{0}' has no remote.
cs: Úložiště {0} nemá žádné vzdálené úložiště.
de: Das Repository "{0}" verfügt über kein Remoterepository.
es: El repositorio "{0}" no tiene repositorio remoto.
fr: Le dépôt '{0}' n'a pas de dépôt distant.
it: Non esiste alcun repository remoto nel repository '{0}'.
ja: リモート リポジトリ '{0}' がありません。
ko: 리포지토리 '{0}'에 원격 리포지토리가 없습니다.
pl: Repozytorium „{0}” nie ma repozytorium zdalnego.
pt_br: O repositório '{0}' não tem nenhum repositório remoto.
ru: Отсутствует удаленный репозиторий для репозитория "{0}".
tr: '{0}' deposunda uzak depo yok.
zh_hans: 存储库“{0}”没有远程。
zh_hant: 存放庫 '{0}' 沒有遠端。

source: Repository has no commit.
cs: Úložiště nemá žádné potvrzení.
de: Kein Commit für Repository vorhanden.
es: El repositorio no tiene commit.
fr: Le dépôt n'a aucune validation.
it: Non esiste alcun commit per il repository.
ja: リポジトリにコミットがありません。
ko: 저장소에 커밋 내역이 없습니다.
pl: W repozytorium nie ma zatwierdzenia.
pt_br: O repositório não tem nenhuma confirmação.
ru: Хранилище не содержит фиксаций.
tr: Depoda işleme yok.
zh_hans: 存储库没有提交。
zh_hant: 存放庫沒有認可。

# RepositoryUrlEvaluationExceededMaximumAllowedDepth
source: Repository URL evaluation exceeded maximum allowed depth of {0} local repositories.
cs: Vyhodnocení adresy URL úložiště překročilo maximální povolenou hloubku {0} místních úložišť.
de: Beim Auswerten der Repository-URL wurde die maximal zulässige Tiefe von {0} lokalen Repositorys überschritten.
es: La evaluación de la dirección URL del repositorio superó la profundidad máxima permitida de {0} repositorios locales.
fr: L'évaluation de l'URL de dépôt a dépassé la profondeur maximale autorisée fixée à {0} dépôts locaux.
it: La valutazione dell'URL del repository ha superato la profondità massima consentita pari a {0} repository locali.
ja: リポジトリ URL の評価が、ローカル リポジトリの許容最大深度 {0} を超えました。
ko: 리포지토리 URL 평가가 허용되는 최대 깊이인 {0}개 로컬 리포지토리를 초과했습니다.
pl: Ocena adresu URL repozytorium przekroczyła maksymalną dozwoloną głębokość równą {0} lokalnym repozytoriom.
pt_br: A avaliação da URL do repositório excedeu a profundidade máxima permitida de {0} repositórios locais.
ru: При определении URL-адреса репозитория была превышена максимально допустимая глубина локальных репозиториев: {0}.
tr: Depo URL değerlendirmesi izin verilen maksimum {0} yerel depo derinliğini aştı.
zh_hans: 存储库 URL 计算超过了允许的最大深度: {0} 个本地存储库。
zh_hant: 存放庫 URL 評估超出允許的 {0} 個本機存放庫深度上限。

# SourceCodeWontBeAvailableViaSourceLink
source: {0} The source code won't be available via Source Link.
cs: {0} Zdrojový kód nebude k dispozici přes Source Link.
de: {0}: Der Quellcode ist nicht über Source Link verfügbar.
es: {0} El código fuente no estará disponible a través del vínculo de origen.
fr: {0} Le code source n'est pas disponible via Source Link.
it: {0} Il codice sorgente non sarà disponibile tramite Source Link.
ja: {0} ソース リンク経由ではソース コードを使用できません。
ko: {0} 소스 링크를 통해 소스 코드를 사용할 수 없습니다.
pl: {0} Kod źródłowy nie będzie dostępny za pośrednictwem linku do źródła.
pt_br: {0} O código-fonte não estará disponível por meio do Source Link.
ru: {0} Исходный код не будет доступен по исходной ссылке.
tr: {0} Kaynak kodu, Kaynak Bağlantısı ile kullanılmaz.
zh_hans: {0} 无法通过源链接获取源代码。
zh_hant: {0} 無法透過 Source Link 使用原始程式碼。

# SubmoduleWithoutCommit
source: Submodule '{0}' doesn't have any commit.
cs: Dílčí modul {0} nemá žádný zápis.
de: Das Submodul "{0}" weist keinen Commit auf.
es: El submódulo "{0}" no tiene ningún "commit".
fr: Le sous-module '{0}' n'a pas de commit.
it: Nel modulo secondario '{0}' non è presente alcun commit.
ja: サブモジュール '{0}' にはコミットがありません。
ko: '{0}' 하위 모듈에 커밋이 없습니다.
pl: Moduł podrzędny „{0}” nie ma żadnego zatwierdzenia.
pt_br: O submódulo '{0}' não tem nenhuma confirmação.
ru: Подмодуль "{0}" не содержит фиксаций.
tr: '{0}' alt modülünde commit yok.
zh_hans: 子模块“{0}”没有任何提交。
zh_hant: 子模組 '{0}' 沒有任何認可。

# UnableToLocateRepository
source: Unable to locate repository with working directory that contains directory '{0}'.
cs: Nejde najít úložiště s pracovním adresářem, který obsahuje adresář {0}.
de: Das Repository mit dem Arbeitsverzeichnis, welches das Verzeichnis "{0}" enthält, wurde nicht gefunden.
es: No se puede encontrar el repositorio con el directorio de trabajo que contiene el directorio "{0}".
fr: Impossible de localiser le dépôt avec le répertoire de travail contenant le répertoire '{0}'.
it: Non è possibile individuare il repository con la directory di lavoro che contiene la directory '{0}'.
ja: ディレクトリ '{0}' を含む作業ディレクトリがあるリポジトリが見つかりません。
ko: 디렉터리 '{0}'이(가) 포함된 작업 디렉터리로 리포지토리를 찾을 수 없습니다.
pl: Nie można zlokalizować repozytorium z katalogiem roboczym zawierającym katalog „{0}”.
pt_br: Não é possível localizar o repositório com o diretório de trabalho que contém o diretório '{0}'.
ru: Не удается найти репозиторий с рабочим каталогом, содержащим каталог "{0}".
tr: '{0}' dizinini içeren çalışma dizini içeren depo bulunamıyor.
zh_hans: 找不到具有带目录“{0}”的工作目录的存储库。
zh_hant: 找不到具有包含目錄 '{0}' 之工作目錄的存放庫。

# UnexpectedCharacter
source: Unexpected character {0}.
cs: Neočekávaný znak {0}.
es: Carácter '{0}' inesperado
fr: Caractère inattendu {0}.
it: Carattere imprevisto {0}.
ja: 予期しない文字 {0}。
pl: Nieoczekiwany znak {0}.
pt_br: Caráter inesperado {0}.
ru: Непредвиденный символ {0}.
tr: Beklenmeyen karakter: {0}.
zh_hant: 未預期的字元 {0}。

source: Unexpected end of file.
cs: Neočekávaný konec souboru
es: Final de archivo inesperado.
fr: Fin de fichier inattendue.
it: Fine del file imprevista.
ja: 予期しないファイルの終わりです。
pl: Nieoczekiwany koniec pliku.
pt_br: Final de arquivo inesperado.
ru: Непредусмотренный конец файла.
tr: Beklenmeyen dosya sonu.
zh_hant: 未預期的檔案結尾。

# UnsupportedRepositoryExtension
source: Unsupported repository extension '{0}'. Only {1} are supported.
cs: Nepodporované rozšíření úložiště {0}. Podporují se jenom {1}.
de: Nicht unterstützte Repository-Erweiterung „{0}“. Nur {1} werden unterstützt.
es: Extensión de repositorio “{0}” no admitida. Solo se admite {1}.
fr: Extension de référentiel non prise en charge '{0}'. Seuls les {1} sont pris en charge.
it: Estensione del repository '{0}' non supportata. Sono supportate solo {1}.
ja: サポートされていないリポジトリ拡張機能 '{0}'。{1} のみがサポートされています。
ko: 지원되지 않는 리포지토리 확장 '{0}'입니다. {1}만 지원됩니다.
pl: Nieobsługiwane rozszerzenie repozytorium „{0}”. Obsługiwane są tylko {1}.
pt_br: Extensão de repositório sem suporte '{0}'. Somente {1} têm suporte.
ru: Неподдерживаемое расширение репозитория "{0}". Поддерживается только {1}.
tr: '{0}' depo uzantısı desteklenmiyor. Yalnızca {1} destekleniyor.
zh_hans: 存储库扩展“{0}”不受支持。仅支持 {1}。
zh_hant: 不支援的存放庫延伸模組 '{0}'。只支援 {1}。

# UnsupportedRepositoryVersion
source: Unsupported repository version {0}. Only versions up to {1} are supported.
cs: Nepodporovaná verze úložiště: {0}. Podporují se jenom verze do {1}.
de: Nicht unterstützte Repositoryversion {0}. Nur Versionen bis {1} werden unterstützt.
es: Versión de repositorio {0} no admitida. Solo se admiten las versiones hasta {1}.
fr: La version du dépôt {0} n'est pas prise en charge. Seules les versions jusqu'à {1} sont prises en charge.
it: La versione {0} del repository non è supportata. Sono supportate solo le versioni fino alla {1}.
ja: サポートされていないリポジトリ バージョン {0}。{1} までのバージョンのみがサポートされています。
ko: {0}은(는) 지원되지 않는 리포지토리 버전입니다. 버전은 최대 {1}까지만 지원됩니다.
pl: Nieobsługiwana wersja repozytorium {0}. Obsługiwane są tylko wersje do {1}.
pt_br: {0} de versão do repositório sem suporte. Há suporte apenas para versões de até {1}.
ru: Неподдерживаемая версия репозитория {0}. Поддерживаются только версии до {1}.
tr: {0} depo sürümü desteklenmiyor. Yalnızca {1} sürümüne kadar olan sürümler desteklenir.
zh_hans: 不支持存储库版本 {0}。支持的最高版本为 {1}。
zh_hant: 不支援的存放庫版本 {0}。最大只支援版本 {1}。

# ValueOfIsNotValidConfigurationScope
source: The value of {0} is not a valid configuration scope: '{1}'.
cs: Hodnota {0} není platný obor konfigurace: {1}
de: Der Wert von "{0}" ist kein gültiger Konfigurationsbereich: "{1}".
es: El valor de {0} no es un ámbito de configuración válido: "{1}".
fr: La valeur de {0} ne se situe pas dans étendue de configuration valide : '{1}'.
it: Il valore di {0} non è un ambito di configurazione valido: '{1}'.
ja: {0} の値が有効な構成スコープではありません: '{1}'。
ko: {0}의 값이 유효한 구성 범위 '{1}'이(가) 아닙니다.
pl: Wartość {0} nie jest prawidłowym zakresem konfiguracji: „{1}”.
pt_br: O valor de {0} não é um escopo de configuração válido: '{1}'.
ru: Значение {0} не является допустимой областью конфигурации: "{1}".
tr: {0} değeri geçerli bir yapılandırma kapsamı değil: '{1}'.
zh_hans: {0} 的值不是有效配置范围:“{1}”。
zh_hant: {0} 的值不是有效的組態範圍: '{1}'。

# ValueOfIsNotValidPath
source: The value of {0} is not a valid path: '{1}'.
cs: Hodnota {0} není platná cesta: {1}.
de: Der Wert von "{0}" ist kein gültiger Pfad: {1}.
es: El valor de {0} no es una ruta de acceso válida: "{1}".
fr: La valeur de {0} n'est pas un chemin valide : '{1}'.
it: Il valore di {0} non è un percorso valido: '{1}'.
ja: {0} の値が有効なパスではありません: '{1}'。
ko: {0}의 값이 유효한 경로 '{1}'이(가) 아닙니다.
pl: Wartość {0} nie jest prawidłową ścieżką: „{1}”.
pt_br: O valor de {0} não é um caminho válido: '{1}'.
ru: Значение {0} не является допустимым путем: "{1}".
tr: {0} değeri geçerli bir yol değil: '{1}'.
zh_hans: {0} 的值不是有效路径:“{1}”。
zh_hant: {0} 的值不是有效的路徑: '{1}'。
